SunCity/src/Catalogs/КассыККМ/КассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КассыККМ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРаспределенияВыручкиПоСекциям</name>
    <type>
      <types>CatalogRef.НастройкиРаспределенияВыручкиПоСекциямФР</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоответствиеВидовОплаты</name>
    <type>
      <types>CatalogRef.СоответствиеВидовОплатыСККМOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКассы</name>
    <type>
      <types>EnumRef.ТипыКассККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРучнойРежимФормированияЧека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФормироватьНефискальныеЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМ</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекаККМВозврат</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПечататьБумажныйЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

SunCity/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоРаспознавания</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>ОблачнаяККТ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьWebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыКассККМ/ТипыКассККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКассККМ</name>
  <enumValues>
    <name>ФискальныйРегистратор</name>
  </enumValues>
  <enumValues>
    <name>ККМED</name>
    <comment>ККМ из другой программы, участвующая в обмене через EnterpriseData</comment>
  </enumValues>
  <enumValues>
    <name>АвтономнаяККМ</name>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
  </enumValues>
  <enumValues>
    <name>СетевоеОборудование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСервисОборудования</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыШаблонов/ТипыШаблонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблонов</name>
  <enumValues>
    <name>ЭтикеткаЦенник</name>
  </enumValues>
  <enumValues>
    <name>ЧекККТ</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаЦенникПринтераЭтикеток</name>
  </enumValues>
  <enumValues>
    <name>ФискальныйЧек</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>ДисконтнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>РегистрационнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаКодМаркировкиИСМП</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/КассыККМ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда
		
		Если НЕ ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ЭлектронныйЧекSMSПередаютсяПрограммой1С   = Ложь;
			ЭлектронныйЧекEmailПередаютсяПрограммой1С = Ложь;
		КонецЕсли;
		
		Если ТипКассы = Перечисления.ТипыКассККМ.ККМOffline
			ИЛИ ТипКассы = Перечисления.ТипыКассККМ.ККМED
			ИЛИ ТипКассы = Перечисления.ТипыКассККМ.СетевоеОборудование Тогда
			Возврат;
		КонецЕсли;

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КассыККМ.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Магазин = &Магазин
		|	И НЕ(КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ККМOffline)
		|				ИЛИ КассыККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ККМED))
		|	И КассыККМ.Владелец = &Владелец
		|	И КассыККМ.РабочееМесто = &РабочееМесто
		|	И НЕ КассыККМ.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Магазин", Магазин);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			Отказ = Истина;
			СтрокаСообщения = НСтр("ru = 'Касса с такими же параметрами уже существует
										 |" + Выборка.Наименование + " :
										 |Магазин      - " + Магазин + "
										 |Организация  - " + Владелец + "
										 |РабочееМесто - " + РабочееМесто + "'"); 
			
			ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения)
		КонецЕсли;
		
		ТипОборудования = ПодключаемоеОборудование.ТипОборудования;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ДанныеЗаполнения.Свойство("Владелец", Владелец);
		ДанныеЗаполнения.Свойство("Магазин", Магазин);
		ДанныеЗаполнения.Свойство("ТипКассы", ТипКассы);
	КонецЕсли;
	
	ИспользоватьБезПодключенияОборудования = НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование");
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		Если Не ЗначениеЗаполнено(ТипКассы) Тогда
			ТипКассы = Перечисления.ТипыКассККМ.АвтономнаяККМ;
		КонецЕсли;
	ИначеЕсли ТипКассы = Перечисления.ТипыКассККМ.ПустаяСсылка() Тогда
		ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор;
	КонецЕсли;
	
	Если ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
		НастройкаРаспределенияВыручкиПоСекциям = Справочники.НастройкиРаспределенияВыручкиПоСекциямФР.РаспределениеПоУмолчанию;
	КонецЕсли;
	
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(,,Владелец);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ИспользоватьБезПодключенияОборудования Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемоеОборудование");
	Иначе
		Если ЭтотОбъект.ТипКассы = Перечисления.ТипыКассККМ.СетевоеОборудование Тогда
			МассивНепроверяемыхРеквизитов.Добавить("РабочееМесто");
			МассивНепроверяемыхРеквизитов.Добавить("Магазин");
		КонецЕсли;
		
		Если ТипКассы = Перечисления.ТипыКассККМ.ККМOffline Тогда
			ПроверяемыеРеквизиты.Добавить("ОфлайнОборудование");
		ИначеЕсли ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
			ПроверяемыеРеквизиты.Добавить("ПодключаемоеОборудование");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
			Если ЗначениеЗаполнено(ТипОборудования) Тогда
				Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ
					ИЛИ ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ЧекККТ, Отказ);
				ИначеЕсли ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор Тогда
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМ", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
					УправлениеШаблонами.ПроверитьТипШаблона(ЭтотОбъект, "ШаблонЧекаККМВозврат", Перечисления.ТипыШаблонов.ФискальныйЧек, Отказ);
				КонецЕсли;
			Иначе
				ТекстСообщения = НСтр("ru = 'У выбранного оборудования не определен тип'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"ПодключаемоеОборудование",
					"Объект",
					Отказ);
			КонецЕсли;
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ТипОборудования");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если Не Отказ Тогда
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ЭтотОбъект.Ссылка, "ИдентификаторНСПК, КлючКассыНСПК");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
